-- MySQL dump 10.13  Distrib 8.0.27, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: hgs
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `breeds`
--

DROP TABLE IF EXISTS `breeds`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `breeds` (
  `breed_idx` int NOT NULL AUTO_INCREMENT,
  `dog_type` varchar(50) NOT NULL,
  PRIMARY KEY (`breed_idx`)
) ENGINE=InnoDB AUTO_INCREMENT=181 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `breeds`
--

LOCK TABLES `breeds` WRITE;
/*!40000 ALTER TABLE `breeds` DISABLE KEYS */;
INSERT INTO `breeds` VALUES (1,'말티즈'),(2,'푸들'),(3,'재패니스 스피츠'),(4,'치와와'),(5,'포메라니안'),(6,'토이푸들'),(7,'시츄'),(8,'비숑 프리제'),(9,'닥스훈트'),(10,'아메리칸 코카 스파니엘'),(11,'요크셔테리어'),(12,'래브라도 리트리버'),(13,'보더콜리'),(14,'비글'),(15,'미니어쳐 핀셔'),(16,'골든 리트리버'),(17,'진돗개'),(18,'꼬똥드툴레아'),(19,'시베리안 허스키'),(20,'보스턴테리어'),(21,'카디건 웰시코기'),(22,'알래스카 말라뮤트'),(23,'빠삐용'),(24,'삽살개'),(25,'펨브록 웰시코기'),(26,'아메리칸 코카 스파니엘'),(27,'라이카'),(28,'풍산개'),(29,'도베르만'),(30,'슈나우저'),(31,'버니즈 마운틴 독'),(32,'샤페이'),(33,'프렌치불독'),(34,'사모예드'),(35,'올드 잉글리쉬 쉽독'),(36,'페키니즈'),(37,'시바견'),(38,'퍼그'),(39,'브라타니 스파니엘'),(40,'케인코르소'),(41,'웨스트하이랜드화이트테리어'),(42,'댕견'),(43,'저먼 셰퍼드 독'),(44,'포메라니안'),(45,'핏불테리어'),(46,'잉글리쉬 코커 스파니엘'),(47,'폭스테리어'),(48,'불독'),(49,'롯드와일러'),(50,'세인트 버나드'),(51,'미니어쳐 슈나우저'),(52,'바셋 하운드'),(53,'프랜치 불독'),(54,'휘핏'),(55,'불 테리어'),(56,'그레이트 피레니즈'),(57,'재패니즈 친'),(58,'셔틀랜드 쉽독'),(59,'잭 러셀 테리어'),(60,'라사압소'),(61,'콜리'),(62,'로트와일러'),(63,'차우 차우'),(64,'제주개'),(65,'베들링턴 테리어'),(66,'아키타'),(67,'아이리쉬 울프하운드'),(68,'바센지'),(69,'러프 콜리'),(70,'오스트랄리안 세퍼드'),(71,'달마시안'),(72,'보르조이'),(73,'킹 찰스 스파니엘'),(74,'웰시코기'),(75,'실키테리어'),(76,'포인터'),(77,'카우카시안 오브차카'),(78,'벨지안 말리노이즈'),(79,'불테리어'),(80,'그레이트 덴'),(81,'골든 리트리버'),(82,'와이어 폭시 테리어'),(83,'불 마스티프'),(84,'비즐라'),(85,'세인트 버나드'),(86,'저먼 세퍼드'),(87,'오스트레일리안 캐틀 독'),(88,'아이리시 세터'),(89,'살루키'),(90,'맨체스터 테리어'),(91,'로디지아 리지백'),(92,'아프간 하운드'),(93,'복서'),(94,'제페니스친'),(95,'차이니즈 크레스트드 독'),(96,'오스트리안 캐틀독'),(97,'스키퍼키'),(98,'아메리칸 폭스 하운드'),(99,'볼조이'),(100,'노리치 테리어'),(101,'벤지언 그로넨달'),(102,'보스턴 테리어'),(103,'뉴펀들랜드'),(104,'마스티프'),(105,'체서피크 베이 리트리버'),(106,'그레이하운드'),(107,'고든 세터'),(108,'피니쉬 스피츠'),(109,'아자와크'),(110,'바이마라너'),(111,'케리 블루 테리어'),(112,'티베탄 테리어'),(113,'엘크하운드'),(114,'비어디드 콜리'),(115,'도고 알젠티노'),(116,'블랙 앤 탄 쿤하운드'),(117,'혹카이도'),(118,'케언테리어'),(119,'에어데일 테리어'),(120,'보더 테리어'),(121,'아이리시 울프하운드'),(122,'유라시안'),(123,'아이누'),(124,'보더 콜리'),(125,'실리햄 테리어'),(126,'당고'),(127,'풀리'),(128,'비글해리어'),(129,'스코티쉬 테리어'),(130,'방뎅'),(131,'블랙러시안테리어'),(132,'오스트랄리안 캘피'),(133,'브리셀 그리펀'),(134,'에어덜 테리어'),(135,'소프트 코티드 휘튼 테리어'),(136,'케언 테리어'),(137,'블러드하운드'),(138,'스코티시 테리어'),(139,'하바네제'),(140,'케이스혼드'),(141,'보더 테리어'),(142,'세터'),(143,'아키바시'),(144,'잉글리쉬 쿤 하운드'),(145,'스코티쉬 디어하운드'),(146,'블러드 하운드 '),(147,'에스키모견'),(148,'아이리시 테리어'),(149,'티베탄 스파니엘'),(150,'단디 디몬트'),(151,'브리어트'),(152,'아이리쉬 테리어'),(153,'댄디 딘몬트 테리어'),(154,'아펜핀셔'),(155,'스태퍼드쉬어 불 테리어'),(156,'볼롱니즈'),(157,'바셑하운드'),(158,'도규 대 보규옥스'),(159,'플랑드르 부비에'),(160,'갈고 에스파놀'),(161,'캐넌 독'),(162,'오스트랄리안 테리어'),(163,'베드링톤 테리어'),(164,'오스트리안 캘피'),(165,'도이치 브라케'),(166,'보비에 드 플란더스'),(167,'브라코 이탈리아노'),(168,'러시안 베어 슈나우져'),(169,'아펜젤러'),(170,'브리쉘그리폰'),(171,'블랙 앤 탄쿤 하운드'),(172,'치엔 크랑카이즈'),(173,'드레버'),(174,'베르가마스코'),(175,'폭스하운드'),(176,'벨지언 그리폰'),(177,'코몬돌'),(178,'핀란드 하운드'),(179,'빌리'),(180,'던커');
/*!40000 ALTER TABLE `breeds` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-02-03 10:04:40
